---
kind: property
id: P:Autodesk.Revit.DB.NumericRevisionSettings.IsValidObject
source: html/e93119a8-b830-f52f-8723-122d1bd15a4c.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.